bid_api/app/controllers/api/v1/auctions_controller.rb

  def index
    auctions = Auction.order(created_at: :desc)
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

  def show
    bids = Bid.order(price: :desc)
---
SELECT "bids".* FROM "bids" ORDER BY "bids"."price" DESC

  def create
    auction = Auction.new(params.require(:auction).permit(:title, :body, :price, :end_at))
    auction.user = current_user
    if auction.save
---
INSERT INTO "auctions" ("title", "body", "created_at", "updated_at", "price", "user_id", "end_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def find_auction
    @auction = Auction.find_by_id(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]