bid_api/app/controllers/api/v1/bids_controller.rb

  def create
    @auction = Auction.find(params[:auction_id])
    bid = Bid.new(params.require(:bid).permit(:id, :price))
    bid.auction = @auction

    if bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bids" ("price", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 190], ["auction_id", 3], ["created_at", "2021-11-19 20:27:30.285348"], ["updated_at", "2021-11-19 20:27:30.285348"]]