bid_api/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("full_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new params.require(:user).permit(:full_name, :email, :password, :password_confirmation)
    if user.save